In [83]:
#Some values in the the FlightNumber column are missing. These numbers are meant
#to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in
#these missing numbers and make the column an integer column (instead of a float
#column).
import pandas as pd
import numpy as np
import math
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'SondON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})


for i in range(1, len(df)):
    if math.isnan(df.loc[i, "FlightNumber"])==True:
        df.loc[i, "FlightNumber"] =(df.loc[(i-1), "FlightNumber"]+10)
df[["FlightNumber"]] = df[["FlightNumber"]].astype(int)
print(df.iloc[:,1])

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [84]:
#The From_To column would be better as two separate columns! Split each string on
#the underscore delimiter _ to give a new temporary DataFrame with the correct values.
#Assign the correct column names to this temporary DataFrame.
tempSer =df.loc[:,"From_To"]
arr=tempSer.str.split("_")
tempdf=pd.DataFrame([],columns=['From', 'To'])
for i in range(0,len(arr)):
    tempdf.loc[i,'From']= arr[i][0]
    tempdf.loc[i,'To']= arr[i][1]
   
print(tempdf)

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    SondON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [85]:
#3. Notice how the capitalisation of the city names is all mixed up in this temporary
#DataFrame. Standardise the strings so that only the first letter is uppercase (e.g.
#"londON" should become "London".)
tempdf.loc[:,"From"] = tempdf.loc[:,"From"].str.upper()
tempdf.loc[:,"To"] = tempdf.loc[:,"To"].str.upper()
print(tempdf.iloc[:,:])

       From         To
0    LONDON      PARIS
1    MADRID      MILAN
2    SONDON  STOCKHOLM
3  BUDAPEST      PARIS
4  BRUSSELS     LONDON

In [86]:
#Delete the From_To column from df and attach the temporary DataFrame from the previous questions.
df.drop(["From_To"],axis=1,inplace=True)
df[["From","To"]] = tempdf
df

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)         10045      [23, 47]    LONDON      PARIS
1    <Air France> (12)         10055            []    MADRID      MILAN
2  (British Airways. )         10065  [24, 43, 87]    SONDON  STOCKHOLM
3       12. Air France         10075          [13]  BUDAPEST      PARIS
4          "Swiss Air"         10085      [67, 32]  BRUSSELS     LONDON

In [87]:
#In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own 
#column, and so on. If there isn't an Nth value, the value should be NaN.
#Expand the Series of lists into a DataFrame named delays, rename the columns delay_1,delay_2, etc. and replace the unwanted RecentDelays column in df with delays.
recdelays= df.iloc[:,2].astype(list)
delays = pd.DataFrame([])
for i  in range(0,len(recdelays)):
   if (recdelays[i]==0):
       delays.loc[i,(j+1)]= []
       continue
   else:
       for j in range(0,len(recdelays[i])):             
            delays.loc[i,(j+1)] = recdelays[i][j]    
delays.rename(columns={1:"delay_1",2:"delay_2",3:"delay_3"},inplace=True)
df = pd.concat([df, delays], axis=1)
df

,Airline,FlightNumber,RecentDelays,From,To,delay_1,delay_2,delay_3
0,KLM(!),10045,"[23, 47]",LONDON,PARIS,23.0,47.0,NaN
1,<Air France> (12),10055,[],MADRID,MILAN,NaN,NaN,NaN
2,(British Airways. ),10065,"[24, 43, 87]",SONDON,STOCKHOLM,24.0,43.0,87.0
3,12. Air France,10075,[13],BUDAPEST,PARIS,13.0,NaN,NaN
4,"""Swiss Air""",10085,"[67, 32]",BRUSSELS,LONDON,67.0,32.0,NaN